Repository: alois9866/lexibot
Catalog: l10n/*/LC_MESSAGES/lexibot.po
Languages: ru

source: Hello, my name is {}. I am a bot. You can type `/help` to know me better...
ru: Привет, меня зовут {}. Я бот. Наберав команду /help , ты можешь узнать,что я умею...

source: Info: You can use the following commands:
ru: Информация: Могут быть вызваны следующие команды:

source: Japanese words: {}
ru: Японские слова: {}

source: Talk to the bot here: t.me/{0} or inside Telegram application: @{0}
ru: Пообщаться с ботом можно здесь: t.me/{0} или внутри приложения Telegram: @{0}

source: Press Ctrl+C to stop the bot...
ru: Нажмите Ctrl+C для завершения работы бота

source: Cleared pending updates for the bot
ru: Предыдущие необработанные обновления были очищены

source: No pending updates for the bot
ru: Отсутствуют необработанные обновления для бота

source: Bot hash {0}
ru: Хэш бота {0}

source: Processing word {}
ru: Обрабатывается слово {}

source: Response status: {} content: {}
ru: Ответный отчёт статус: {} содержимое: {}

source: Check out word translations:
ru: Переводы слов можно посмотреть далее:

source: Most popular words:
ru: Наиболее популярные слова:

source: - `{}` was clicked {}
ru: - `{}` было щёлкнуто {}

source: time
ru: раз

source: this week
ru: на этой неделе

source: Starting up the {} bot custom behaviour...
ru: Инициирую работу заданного сценария для бота

source: Finishing custom bot behaviour.
ru: Завершаю работу заданного сценария для бота

source: Main script to invoke custom Telegram bots
ru: Главный модуль для запуска настраиваемых сценариев для Telegram-ботов

source: .json configuration file, check README.md for an example
ru: конфигурационный .json файл, пример использования можно посмотреть в README.md

source: whether to print debug messages from logger
ru: выводить ли отладочные сообщения

source: --config_path is not provided.
ru: --config_path параметр не выставлен

source: You have to provide Telegram token
ru: Вам необходимо предоставить Telegram token

source: You have to provide server ip address bot interacts with
ru: Вам необходимо предоставить ip-адрес сервера, с которым будет взаимодействовать бот-клиент

source: variable is not set: should contain DB user name.
ru: переменная не выставлена: она должна содержать имя для базы данных

source: variable is not set: should contain DB user password.
ru: переменная не выставлена: она должна содержать пароль для базы данных

source: variable is not set: should contain DB host address.
ru: переменная не выставлена: она должна содержать ip-адрес для базы данных

source: "server" parameter is not set in config file.
ru: параметр "server" не выставлен в конфигурационном файле

source: "server.ip" parameter is not set in config file.
ru: параметр "server.ip" не выставлен в конфигурационном файле

source: "server.port" parameter is not set in config file.
ru: параметр "server.port" не выставлен в конфигурационном файле

source: "token" parameter is not set in config file: should contain token of corresponding Telegram bot client.
ru: параметр "token" не выставлен в конфигурационном файле, он должен содержать token для соответствующего Telegram-бота

source: Starting server at {}:{}
ru: Запускаю сервер на {}:{}

source: Not started.
ru: Не было запущено.

source: Request not in JSON format
ru: Запрос представлен не в JSON формате

source: No valid input provided
ru: Обнаружен некорректный ввод

source: No bot token hash provided
ru: Не предоставлен token hash

source: Incorrect bot token hash
ru: Некорректный token hash для бота

source: No chat ID provided
ru: Не обнаружено chat ID

source: ERROR
ru: ОШИБКА

source: Error: {}
ru: Ошибка: {}
